wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_pkcau.c
/*!
    \file    gd32h77x_pkcau.c
    \brief   PKCAU driver

    \version 2025-09-29, V0.2.0, firmware for GD32H77x
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32h77x_pkcau.h"

#define PKCAU_MODE_SET_MASK                   (uint32_t)0x00003F00U
#define PKCAU_MODE_MOD_MASK                   (uint32_t)0x00001F00U
#define PKCAU_MODE_EXP_MASK                   (uint32_t)0x00000200U
#define PKCAU_MODE_ARITHMETIC_MASK            (uint32_t)0x00000F00U
#define PKCAU_MODE_ECC_SCALAR_MUL_MASK        (uint32_t)0x00002200U
#define PKCAU_GET_FLAG_MASK                   (uint32_t)0x001B0000U
#define PKCAU_CLEAR_FLAG_MASK                 (uint32_t)0x001A0000U
#define PKCAU_INT_MASK                        (uint32_t)0x001A0000U

/* timeout definition */
#define PKCAU_DELAY                           ((uint32_t)0x01FFFFFFU)

/* read result from PKCAU RAM */
static void pkcau_memcpy_value(uint32_t offset, uint32_t value);
/* copy operand with EOS or ROS to PKCAU RAM */
static void pkcau_memcpy_operand(uint32_t offset, const uint8_t operand[], uint32_t size);
/* read result from PKCAU RAM */
static void pkcau_memread(uint32_t offset, uint8_t buf[], uint32_t size);

/*!
    \brief      reset PKCAU (API_ID(0x0001U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pkcau_deinit(void)
{
    rcu_periph_reset_enable(RCU_PKCAURST);
    rcu_periph_reset_disable(RCU_PKCAURST);
}

/*!
    \brief      initialize montgomery parameter structure with a default value (API_ID(0x0002U))
    \param[in]  none
    \param[out] init_para: initialize montgomery parameter struct
    \retval     none
*/
void pkcau_mont_struct_para_init(pkcau_mont_parameter_struct *init_para)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(init_para)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x0002U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the member of montgomery parameter structure with the default value */
        init_para->modulus_n     = 0U;
        init_para->modulus_n_len = 0U;
    }
}

/*!
    \brief      initialize modular parameter structure with a default value (API_ID(0x0003U))
    \param[in]  none
    \param[out] init_para: initialize modular parameter struct
    \retval     none
*/
void pkcau_mod_struct_para_init(pkcau_mod_parameter_struct *init_para)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(init_para)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x0003U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the member of modular parameter structure with the default value */
        init_para->oprd_a        = 0U;
        init_para->oprd_a_len    = 0U;
        init_para->oprd_b        = 0U;
        init_para->oprd_b_len    = 0U;
        init_para->modulus_n     = 0U;
        init_para->modulus_n_len = 0U;
    }
}

/*!
    \brief      initialize modular exponentiation parameter structure with a default value (API_ID(0x0004U))
    \param[in]  none
    \param[out] init_para: initialize modular exponentiation parameter struct
    \retval     none
*/
void pkcau_mod_exp_struct_para_init(pkcau_mod_exp_parameter_struct *init_para)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(init_para)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x0004U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the member of modular exponentiation parameter structure with the default value */
        init_para->oprd_a        = 0U;
        init_para->oprd_a_len    = 0U;
        init_para->exp_e         = 0U;
        init_para->e_len         = 0U;
        init_para->modulus_n     = 0U;
        init_para->modulus_n_len = 0U;
        init_para->mont_para     = 0U;
        init_para->mont_para_len = 0U;
    }
}

/*!
    \brief      initialize arithmetic parameter structure with a default value (API_ID(0x0005U))
    \param[in]  none
    \param[out] init_para: initialize arithmetic parameter struct
    \retval     none
*/
void pkcau_arithmetic_struct_para_init(pkcau_arithmetic_parameter_struct *init_para)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(init_para)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x0005U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the member of arithmetic parameter structure with the default value */
        init_para->oprd_a     = 0U;
        init_para->oprd_a_len = 0U;
        init_para->oprd_b     = 0U;
        init_para->oprd_b_len = 0U;
    }
}

/*!
    \brief      initialize CRT parameter structure with a default value (API_ID(0x0006U))
    \param[in]  none
    \param[out] init_para: initialize CRT parameter struct
    \retval     none
*/
void pkcau_crt_struct_para_init(pkcau_crt_parameter_struct *init_para)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(init_para)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x0006U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the member of CRT parameter structure with the default value */
        init_para->oprd_a        = 0U;
        init_para->oprd_a_len    = 0U;
        init_para->oprd_dp       = 0U;
        init_para->oprd_dp_len   = 0U;
        init_para->oprd_dq       = 0U;
        init_para->oprd_dq_len   = 0U;
        init_para->oprd_qinv     = 0U;
        init_para->oprd_qinv_len = 0U;
        init_para->oprd_p        = 0U;
        init_para->oprd_p_len    = 0U;
        init_para->oprd_q        = 0U;
        init_para->oprd_q_len    = 0U;
    }
}

/*!
    \brief      initialize ECC curve parameter structure with a default value (API_ID(0x0007U))
    \param[in]  none
    \param[out] init_para: initialize ECC curve parameter struct
    \retval     none
*/
void pkcau_ec_group_struct_para_init(pkcau_ec_group_parameter_struct *init_para)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(init_para)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x0007U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the member of ECC curve parameter structure with the default value */
        init_para->modulus_p         = 0U;
        init_para->modulus_p_len     = 0U;
        init_para->coff_a            = 0U;
        init_para->coff_a_len        = 0U;
        init_para->coff_b            = 0U;
        init_para->coff_b_len        = 0U;
        init_para->base_point_x      = 0U;
        init_para->base_point_x_len  = 0U;
        init_para->base_point_y      = 0U;
        init_para->base_point_y_len  = 0U;
        init_para->order_n           = 0U;
        init_para->order_n_len       = 0U;
        init_para->a_sign            = 0U;
        init_para->multi_k           = 0U;
        init_para->multi_k_len       = 0U;
        init_para->integer_k         = 0U;
        init_para->integer_k_len     = 0U;
        init_para->private_key_d     = 0U;
        init_para->private_key_d_len = 0U;
        init_para->mont_para         = 0U;
        init_para->mont_para_len     = 0U;
    }
}

/*!
    \brief      initialize point parameter structure with a default value (API_ID(0x0008U))
    \param[in]  none
    \param[out] init_para: initialize point parameter struct
    \retval     none
*/
void pkcau_point_struct_para_init(pkcau_point_parameter_struct *init_para)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(init_para)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x0008U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the member of point parameter structure with the default value */
        init_para->point_x     = 0U;
        init_para->point_x_len = 0U;
        init_para->point_y     = 0U;
        init_para->point_y_len = 0U;
    }
}

/*!
    \brief      initialize signature parameter structure with a default value (API_ID(0x0009U))
    \param[in]  none
    \param[out] init_para: initialize signature parameter struct
    \retval     none
*/
void pkcau_signature_struct_para_init(pkcau_signature_parameter_struct *init_para)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(init_para)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x0009U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the member of signature parameter structure with the default value */
        init_para->sign_r     = 0U;
        init_para->sign_r_len = 0U;
        init_para->sign_s     = 0U;
        init_para->sign_s_len = 0U;
    }
}

/*!
    \brief      initialize hash parameter structure with a default value (API_ID(0x000AU))
    \param[in]  none
    \param[out] init_para: initialize hash parameter struct
    \retval     none
*/
void pkcau_hash_struct_para_init(pkcau_hash_parameter_struct *init_para)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(init_para)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x000AU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the member of hash parameter structure with the default value */
        init_para->hash_z     = 0U;
        init_para->hash_z_len = 0U;
    }
}

/*!
    \brief      initialize ECC out parameter structure with a default value (API_ID(0x000BU))
    \param[in]  none
    \param[out] init_para: initialize ECC out parameter struct
    \retval     none
*/
void pkcau_ecc_out_struct_para_init(pkcau_ecc_out_struct *init_para)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(init_para)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x000BU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize ecc output parameter structure with a default value */
        init_para->sign_extra = 0U;
        init_para->point_x    = 0U;
        init_para->point_y    = 0U;
        init_para->sign_r     = 0U;
        init_para->sign_s     = 0U;
    }
}

/*!
    \brief      enable PKCAU (API_ID(0x000CU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pkcau_enable(void)
{
    PKCAU_CTL |= PKCAU_CTL_PKCAUEN;
}

/*!
    \brief      disable PKCAU (API_ID(0x000DU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pkcau_disable(void)
{
    PKCAU_CTL &= ~PKCAU_CTL_PKCAUEN;
}

/*!
    \brief      start operation (API_ID(0x000EU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pkcau_start(void)
{
    PKCAU_CTL |= PKCAU_CTL_START;
}

/*!
    \brief      configure the PKCAU operation mode (API_ID(0x000FU))
    \param[in]  mode: PKCAU operation mode
                only one parameter can be selected which is shown as below:
      \arg        PKCAU_MODE_MOD_EXP: Montgomery parameter computation then modular exponentiation
      \arg        PKCAU_MODE_MONT_PARAM: Montgomery parameter computation only
      \arg        PKCAU_MODE_MOD_EXP_FAST: modular exponentiation only
      \arg        PKCAU_MODE_CRT_EXP: RSA CRT exponentiation
      \arg        PKCAU_MODE_MOD_INVERSION: modular inversion
      \arg        PKCAU_MODE_ARITHMETIC_ADD: arithmetic addition
      \arg        PKCAU_MODE_ARITHMETIC_SUB: arithmetic subtraction
      \arg        PKCAU_MODE_ARITHMETIC_MUL: arithmetic multiplication
      \arg        PKCAU_MODE_ARITHMETIC_COMP: arithmetic comparison
      \arg        PKCAU_MODE_MOD_REDUCTION: modular reduction
      \arg        PKCAU_MODE_MOD_ADD: modular addition
      \arg        PKCAU_MODE_MOD_SUB: modular subtraction
      \arg        PKCAU_MODE_MONT_MUL: Montgomery multiplication
      \arg        PKCAU_MODE_ECC_SCALAR_MUL: Montgomery parameter computation then ECC scalar multiplication
      \arg        PKCAU_MODE_ECC_SCALAR_MUL_FAST: ECC scalar multiplication only
      \arg        PKCAU_MODE_ECDSA_SIGN: ECDSA sign
      \arg        PKCAU_MODE_ECDSA_VERIFICATION: ECDSA verification
      \arg        PKCAU_MODE_POINT_CHECK: point on elliptic curve Fp check
    \retval     none
*/
void pkcau_mode_set(uint32_t mode)
{
    PKCAU_CTL &= ~PKCAU_CTL_MODESEL;
    PKCAU_CTL |= (mode & PKCAU_MODE_SET_MASK);
}

/*!
    \brief      execute montgomery parameter operation (API_ID(0x0010U))
                This function can only be used when interrupt is not enabled
    \param[in]  mont_para: PKCAU montgomery parameter struct
                  modulus_n: modulus value n
                  modulus_n_len: modulus length in byte
    \param[out] results: output buffer
    \retval     none
    \note       This function includes timeout exit scenarios.
                Modify according to the user's actual usage scenarios.
*/
void pkcau_mont_param_operation(pkcau_mont_parameter_struct *mont_para, uint8_t *results)
{
    uint32_t timeout;

