wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_pkcau.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameters */
    if(NOT_VALID_POINTER(mod_exp_para)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x0012U), ERR_PARAM_POINTER);
    }  else if(NOT_VALID_POINTER(results)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x0012U), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(mod_exp_para->oprd_a) || NOT_VALID_POINTER(mod_exp_para->exp_e) || NOT_VALID_POINTER(mod_exp_para->modulus_n)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x0012U), ERR_PARAM_POINTER);
    } else if((0U == mod_exp_para->oprd_a_len) || (0U == mod_exp_para->e_len) || (0U == mod_exp_para->modulus_n_len)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x0012U), ERR_PARAM_INVALID);
    } else if((mode == PKCAU_MODE_MOD_EXP_FAST) && (NOT_VALID_POINTER(mod_exp_para->mont_para) || (0U == mod_exp_para->mont_para_len))) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x0012U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* reset PKCAU */
        pkcau_deinit();
        /* enable PKCAU */
        pkcau_enable();
        /* wait for PKCAU busy flag to reset */
        timeout = PKCAU_DELAY;
        while((RESET != pkcau_flag_get(PKCAU_FLAG_BUSY)) && (0U != timeout)) {
            timeout--;
        }
        /* clear end flag */
        pkcau_flag_clear(PKCAU_FLAG_END);

        /* write the exponent length and modulus length in bit to PKCAU RAM */
        pkcau_memcpy_value(0x00000400U, (mod_exp_para->e_len << 3));
        pkcau_memcpy_value(0x00000404U, (mod_exp_para->modulus_n_len << 3));

        /* write the operand A, exponent e and modulus value n to PKCAU RAM */
        pkcau_memcpy_operand(0x00000A44U, mod_exp_para->oprd_a, mod_exp_para->oprd_a_len);
        pkcau_memcpy_operand(0x00000BD0U, mod_exp_para->exp_e, mod_exp_para->e_len);
        pkcau_memcpy_operand(0x00000D5CU, mod_exp_para->modulus_n, mod_exp_para->modulus_n_len);
        /* write the montgomery parameter to PKCAU RAM */
        if(mode == PKCAU_MODE_MOD_EXP_FAST) {
            pkcau_memcpy_operand(0x00000594U, mod_exp_para->mont_para, mod_exp_para->mont_para_len);
        }
        /* configure the operation mode */
        pkcau_mode_set(mode & PKCAU_MODE_EXP_MASK);
        /* start computation */
        pkcau_start();

        /* wait for PKCAU operation completed */
        timeout = PKCAU_DELAY;
        while((SET != pkcau_flag_get(PKCAU_FLAG_END)) && (0U != timeout)) {
            timeout--;
        }
        /* read results from RAM address */
        pkcau_memread(0x724U, (uint8_t *)results, mod_exp_para->modulus_n_len);

        /* clear end flag */
        pkcau_flag_clear(PKCAU_FLAG_END);
        /* disable PKCAU */
        pkcau_disable();
    }
}

/*!
    \brief      execute modular inversion operation
                This function can only be used when interrupt is not enabled (API_ID(0x0013U))
    \param[in]  mod_inver_para: PKCAU modular inversion parameter struct
                  oprd_a: operand A
                  oprd_a_len: operand A length in byte
                  modulus_n: modulus value n
                  modulus_n_len: modulus length in byte
    \param[out] results: output buffer
    \retval     none
    \note       This function includes timeout exit scenarios.
                Modify according to the user's actual usage scenarios.
*/
void pkcau_mod_inver_operation(pkcau_mod_parameter_struct *mod_inver_para, uint8_t *results)
{
    uint32_t timeout;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameters */
    if(NOT_VALID_POINTER(mod_inver_para)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x0013U), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(results)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x0013U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* reset PKCAU */
        pkcau_deinit();
        /* enable PKCAU */
        pkcau_enable();
        /* wait for PKCAU busy flag to reset */
        timeout = PKCAU_DELAY;
        while((RESET != pkcau_flag_get(PKCAU_FLAG_BUSY)) && (0U != timeout)) {
            timeout--;
        }
        /* clear end flag */
        pkcau_flag_clear(PKCAU_FLAG_END);

        /* write the modulus length in bit to PKCAU RAM */
        pkcau_memcpy_value(0x00000404U, (mod_inver_para->modulus_n_len) << 3);

        /* write the operand A and modulus value n to PKCAU RAM */
        pkcau_memcpy_operand(0x000008B4U, mod_inver_para->oprd_a, mod_inver_para->oprd_a_len);
        pkcau_memcpy_operand(0x00000A44U, mod_inver_para->modulus_n, mod_inver_para->modulus_n_len);
        /* configure the operation mode */
        pkcau_mode_set(PKCAU_MODE_MOD_INVERSION);
        /* start computation */
        pkcau_start();

        /* wait for PKCAU operation completed */
        timeout = PKCAU_DELAY;
        while((SET != pkcau_flag_get(PKCAU_FLAG_END)) && (0U != timeout)) {
            timeout--;
        }
        /* read results from RAM address */
        pkcau_memread(0xBD0U, (uint8_t *)results, mod_inver_para->modulus_n_len);
        /* clear end flag */
        pkcau_flag_clear(PKCAU_FLAG_END);
        /* disable PKCAU */
        pkcau_disable();
    }
}

/*!
    \brief      execute modular reduction operation
                This function can only be used when interrupt is not enabled (API_ID(0x0014U))
    \param[in]  mod_reduc_para: PKCAU modular reduction parameter struct
                  oprd_a: operand A
                  oprd_a_len: length of operand A in byte
                  modulus_n: modulus value n
                  modulus_n_len: modulus length in byte
    \param[out] results: output buffer
    \retval     none
    \note       This function includes timeout exit scenarios.
                Modify according to the user's actual usage scenarios.
*/
void pkcau_mod_reduc_operation(pkcau_mod_parameter_struct *mod_reduc_para, uint8_t *results)
{
    uint32_t timeout;

