wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_pkcau.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameters */
    if(NOT_VALID_POINTER(mod_reduc_para)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x0014U), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(results)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x0014U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* reset PKCAU */
        pkcau_deinit();
        /* enable PKCAU */
        pkcau_enable();
        /* wait for PKCAU busy flag to reset */
        timeout = PKCAU_DELAY;
        while((RESET != pkcau_flag_get(PKCAU_FLAG_BUSY)) && (0U != timeout)) {
            timeout--;
        }
        /* clear end flag */
        pkcau_flag_clear(PKCAU_FLAG_END);

        /* write the modulus length and length of operand A in bit to PKCAU RAM */
        pkcau_memcpy_value(0x00000400U, (mod_reduc_para->oprd_a_len) << 3);
        pkcau_memcpy_value(0x00000404U, (mod_reduc_para->modulus_n_len) << 3);

        /* write the operand A and modulus value n to PKCAU RAM */
        pkcau_memcpy_operand(0x000008B4U, mod_reduc_para->oprd_a, mod_reduc_para->oprd_a_len);
        pkcau_memcpy_operand(0x00000A44U, mod_reduc_para->modulus_n, mod_reduc_para->modulus_n_len);
        /* configure the operation mode */
        pkcau_mode_set(PKCAU_MODE_MOD_REDUCTION);
        /* start computation */
        pkcau_start();

        /* wait for PKCAU operation completed */
        timeout = PKCAU_DELAY;
        while((SET != pkcau_flag_get(PKCAU_FLAG_END)) && (0U != timeout)) {
            timeout--;
        }
        /* read results from RAM address */
        pkcau_memread(0xBD0U, (uint8_t *)results, mod_reduc_para->modulus_n_len);
        /* clear end flag */
        pkcau_flag_clear(PKCAU_FLAG_END);
        /* disable PKCAU */
        pkcau_disable();
    }
}

/*!
    \brief      execute arithmetic operation
                This function can only be used when interrupt is not enabled (API_ID(0x0015U))
    \param[in]  arithmetic_para: PKCAU arithmetic parameter struct
                  oprd_a: operand A
                  oprd_a_len: length of operand A in byte
                  oprd_b: operand B
                  oprd_b_len: length of operand B in byte
    \param[in]  mode: arithmetic operation mode
                only one parameter can be selected which is shown as below:
      \arg        PKCAU_MODE_ARITHMETIC_ADD: arithmetic addition
      \arg        PKCAU_MODE_ARITHMETIC_SUB: arithmetic subtraction
      \arg        PKCAU_MODE_ARITHMETIC_MUL: arithmetic multiplication
      \arg        PKCAU_MODE_ARITHMETIC_COMP: arithmetic comparison
    \param[out] results: output buffer
    \retval     none
    \note       This function includes timeout exit scenarios.
                Modify according to the user's actual usage scenarios.
*/
void pkcau_arithmetic_operation(pkcau_arithmetic_parameter_struct *arithmetic_para, uint32_t mode, uint8_t *results)
{
    uint32_t size = 0U;
    uint32_t timeout;

    uint32_t max_len = (arithmetic_para->oprd_a_len > arithmetic_para->oprd_b_len) ? \
                       arithmetic_para->oprd_a_len : arithmetic_para->oprd_b_len;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameters */
    if(NOT_VALID_POINTER(arithmetic_para)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x0015U), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(results)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x0015U), ERR_PARAM_POINTER);
    } else if((0U == arithmetic_para->oprd_a_len) || (0U == arithmetic_para->oprd_b_len)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x0015U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* reset PKCAU */
        pkcau_deinit();
        /* enable PKCAU */
        pkcau_enable();
        /* wait for PKCAU busy flag to reset */
        timeout = PKCAU_DELAY;
        while((RESET != pkcau_flag_get(PKCAU_FLAG_BUSY)) && (0U != timeout)) {
            timeout--;
        }
        /* clear end flag */
        pkcau_flag_clear(PKCAU_FLAG_END);

        /* calculate number of bytes to read */
        switch(mode) {
        case PKCAU_MODE_ARITHMETIC_ADD:
            size = max_len + 1U;
            break;
        case PKCAU_MODE_ARITHMETIC_SUB:
            size = max_len;
            break;
        case PKCAU_MODE_ARITHMETIC_MUL:
            size = arithmetic_para->oprd_a_len + arithmetic_para->oprd_b_len;
            break;
        case PKCAU_MODE_ARITHMETIC_COMP:
            size = 1U;
            break;
        default:
            break;
        }

        /* write the length of operand in bits to PKCAU RAM */
        pkcau_memcpy_value(0x00000404U, max_len << 3);

        /* write the operand A and operand B to PKCAU RAM */
        pkcau_memcpy_operand(0x000008B4U, arithmetic_para->oprd_a, arithmetic_para->oprd_a_len);
        pkcau_memcpy_operand(0x00000A44U, arithmetic_para->oprd_b, arithmetic_para->oprd_b_len);
        /* configure the operation mode */
        pkcau_mode_set(mode & PKCAU_MODE_ARITHMETIC_MASK);
        /* start computation */
        pkcau_start();

        /* wait for PKCAU operation completed */
        timeout = PKCAU_DELAY;
        while((SET != pkcau_flag_get(PKCAU_FLAG_END)) && (0U != timeout)) {
            timeout--;
        }
        /* read results from RAM address */
        pkcau_memread(0xBD0U, (uint8_t *)results, size);
        /* clear end flag */
        pkcau_flag_clear(PKCAU_FLAG_END);
        /* disable PKCAU */
        pkcau_disable();
    }
}

/*!
    \brief      execute RSA CRT exponentiation operation
                This function can only be used when interrupt is not enabled (API_ID(0x0016U))
    \param[in]  crt_para: PKCAU modular CRT parameter struct
                  oprd_a: operand A
                  oprd_a_len: length of operand A in byte
                  oprd_dp: operand dp
                  oprd_dp_len: length of operand dp in byte
                  oprd_dq:operand dq
                  oprd_dq_len: length of operand dq in byte
                  oprd_qinv: operand qinv
                  oprd_qinv_len: length of operand qinv in byte
                  oprd_p: prime operand p
                  oprd_p_len: length of operand p in byte
                  oprd_q: prime operand q
                  oprd_q_len: length of operand q in byte
    \param[out] results: output buffer
    \retval     none
    \note       This function includes timeout exit scenarios.
                Modify according to the user's actual usage scenarios.
*/
void pkcau_crt_exp_operation(pkcau_crt_parameter_struct *crt_para, uint8_t *results)
{
    uint32_t timeout;

