wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_pkcau.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameters */
    if(NOT_VALID_POINTER(crt_para)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x0016U), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(results)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x0016U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* reset PKCAU */
        pkcau_deinit();
        /* enable PKCAU */
        pkcau_enable();
        /* wait for PKCAU busy flag to reset */
        timeout = PKCAU_DELAY;
        while((RESET != pkcau_flag_get(PKCAU_FLAG_BUSY)) && (0U != timeout)) {
            timeout--;
        }
        /* clear end flag */
        pkcau_flag_clear(PKCAU_FLAG_END);

        /* write the modulus length in bit to PKCAU RAM */
        pkcau_memcpy_value(0x00000404U, (crt_para->oprd_a_len << 3));

        /* write the operand dp, dq, qinv, p and q to PKCAU RAM */
        pkcau_memcpy_operand(0x0000065CU, crt_para->oprd_dp, crt_para->oprd_dp_len);
        pkcau_memcpy_operand(0x00000BD0U, crt_para->oprd_dq, crt_para->oprd_dq_len);
        pkcau_memcpy_operand(0x000007ECU, crt_para->oprd_qinv, crt_para->oprd_qinv_len);
        pkcau_memcpy_operand(0x0000097CU, crt_para->oprd_p, crt_para->oprd_p_len);
        pkcau_memcpy_operand(0x00000D5CU, crt_para->oprd_q, crt_para->oprd_q_len);
        /* write the operand A to PKCAU RAM */
        pkcau_memcpy_operand(0x00000EECU, crt_para->oprd_a, crt_para->oprd_a_len);
        /* configure the operation mode */
        pkcau_mode_set(PKCAU_MODE_CRT_EXP);
        /* start computation */
        pkcau_start();

        /* wait for PKCAU operation completed */
        timeout = PKCAU_DELAY;
        while((SET != pkcau_flag_get(PKCAU_FLAG_END)) && (0U != timeout)) {
            timeout--;
        }
        /* read results from RAM address */
        pkcau_memread(0x724U, (uint8_t *)results, crt_para->oprd_a_len);
        /* clear end flag */
        pkcau_flag_clear(PKCAU_FLAG_END);
        /* disable PKCAU */
        pkcau_disable();
    }
}

/*!
    \brief      execute point check operation
                This function can only be used when interrupt is not enabled (API_ID(0x0017U))
    \param[in]  point_para: PKCAU point struct
                  point_x: point coordinate x
                  point_x_len: point coordinate x length in byte
                  point_y: point coordinate y
                  point_y_len: point coordinate y length in byte
    \param[in]  curve_group_para: PKCAU ECC curve parameter struct
                  modulus_p: curve modulus p
                  modulus_p_len: curve modulus p length in byte
                  coff_a: curve coefficient a
                  coff_a_len: curve coefficient a length in byte
                  coff_b: curve coefficient b
                  coff_b_len: curve coefficient b length in byte
                  base_point_x: curve base point coordinate x
                  base_point_x_len: curve base point coordinate x length in byte
                  base_point_y: curve base point coordinate y
                  base_point_y_len: curve base point coordinate y length in byte
                  order_n: curve prime order n
                  order_n_len: curve prime order n length in byte
                  a_sign: curve coefficient a sign
                  multi_k: scalar multiplier k
                  multi_k_len: scalar multiplier k length in byte
                  integer_k: integer k length in byte
                  integer_k_len: integer k length in byte
                  private_key_d: private key d
                  private_key_d_len: private key d length in byte
                  mont_para: montgomery parameter R2 mod n
                  mont_para_len: montgomery parameter R2 mod n length in byte
    \param[out] none
    \retval     flag indicating whether the point is on an elliptic curve or not
    \note       This function includes timeout exit scenarios.
                Modify according to the user's actual usage scenarios.
*/
uint8_t pkcau_point_check_operation(pkcau_point_parameter_struct *point_para,
                                    const pkcau_ec_group_parameter_struct *curve_group_para)
{
    uint8_t res = 1U;
    uint32_t timeout;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameters */
    if(NOT_VALID_POINTER(point_para)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x0017U), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(curve_group_para)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x0017U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* reset PKCAU */
        pkcau_deinit();
        /* enable PKCAU */
        pkcau_enable();
        /* wait for PKCAU busy flag to reset */
        timeout = PKCAU_DELAY;
        while((RESET != pkcau_flag_get(PKCAU_FLAG_BUSY)) && (0U != timeout)) {
            timeout--;
        }
        /* clear end flag */
        pkcau_flag_clear(PKCAU_FLAG_END);

        /* write the modulus length in bit to PKCAU RAM */
        pkcau_memcpy_value(0x00000404U, (curve_group_para->modulus_p_len << 3));
        /* write the sign of curve coefficient a to PKCAU RAM */
        pkcau_memcpy_value(0x00000408U, curve_group_para->a_sign);

        /* write the curve coefficient a, curve coefficient b and curve modulus p to PKCAU RAM */
        pkcau_memcpy_operand(0x0000040CU, curve_group_para->coff_a, curve_group_para->coff_a_len);
        pkcau_memcpy_operand(0x000007FCU, curve_group_para->coff_b, curve_group_para->coff_b_len);
        pkcau_memcpy_operand(0x00000460U, curve_group_para->modulus_p, curve_group_para->modulus_p_len);
        /* write the point coordinate x and point coordinate y to PKCAU RAM */
        pkcau_memcpy_operand(0x0000055CU, point_para->point_x, point_para->point_x_len);
        pkcau_memcpy_operand(0x000005B0U, point_para->point_y, point_para->point_y_len);
        /* configure the operation mode */
        pkcau_mode_set(PKCAU_MODE_POINT_CHECK);
        /* start computation */
        pkcau_start();

        /* wait for PKCAU operation completed */
        timeout = PKCAU_DELAY;
        while((SET != pkcau_flag_get(PKCAU_FLAG_END)) && (0U != timeout)) {
            timeout--;
        }
        /* read results from RAM address */
        pkcau_memread(0x400U, (uint8_t *)&res, 1U);
        /* clear end flag */
        pkcau_flag_clear(PKCAU_FLAG_END);
        /* disable PKCAU */
        pkcau_disable();
    }
    return res;
}

/*!
    \brief      execute point multiplication operation
                This function can only be used when interrupt is not enabled (API_ID(0x0018U))
    \param[in]  point_para: PKCAU point struct
                  point_x: point coordinate x
                  point_x_len: point coordinate x length in byte
                  point_y: point coordinate y
                  point_y_len: point coordinate y length in byte
    \param[in]  curve_group_para: PKCAU ECC curve parameter struct
                  modulus_p: curve modulus p
                  modulus_p_len: curve modulus p length in byte
                  coff_a: curve coefficient a
                  coff_a_len: curve coefficient a length in byte
                  coff_b: curve coefficient b
                  coff_b_len: curve coefficient b length in byte
                  base_point_x: curve base point coordinate x
                  base_point_x_len: curve base point coordinate x length in byte
                  base_point_y: curve base point coordinate y
                  base_point_y_len: curve base point coordinate y length in byte
                  order_n: curve prime order n
                  order_n_len: curve prime order n length in byte
                  a_sign: curve coefficient a sign

                  multi_k: scalar multiplier k
                  multi_k_len: scalar multiplier k length in byte
                  integer_k: integer k length in byte
                  integer_k_len: integer k length in byte
                  private_key_d: private key d
                  private_key_d_len: private key d length in byte
                  mont_para: montgomery parameter R2 mod n
                  mont_para_len: montgomery parameter R2 mod n length in byte
    \param[in]  mode: point multiplication operation mode
                only one parameter can be selected which is shown as below:
      \arg        PKCAU_MODE_ECC_SCALAR_MUL_FAST: montgomery parameter computation then ECC scalar multiplication
      \arg        PKCAU_MODE_ECC_SCALAR_MUL: ECC scalar multiplication only
    \param[out] result: ecdsa signature, ecc scalar multiplication output structure
                  sign_extra: flag of extended ECDSA sign (extra outputs)
                  sign_r: pointer to signature part r
                  sign_s: pointer to signature part s
                  point_x: pointer to point kP coordinate x
                  point_y: pointer to point kP coordinate y
    \retval     none
    \note       This function includes timeout exit scenarios.
                Modify according to the user's actual usage scenarios.
*/
void pkcau_point_mul_operation(pkcau_point_parameter_struct *point_para,
                               const pkcau_ec_group_parameter_struct *curve_group_para, \
                               uint32_t mode, pkcau_ecc_out_struct *result)
{
    uint32_t timeout;

