wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_pkcau.c
        /* write the curve coefficient a to PKCAU RAM */
        pkcau_memcpy_operand(0x0000040CU, curve_group_para->coff_a, curve_group_para->coff_a_len);
        /* write the curve modulus p to PKCAU RAM */
        pkcau_memcpy_operand(0x00000460U, curve_group_para->modulus_p, curve_group_para->modulus_p_len);
        /* write the integer k to PKCAU RAM */
        pkcau_memcpy_operand(0x00000508U, curve_group_para->integer_k, curve_group_para->integer_k_len);
        /* write the curve base point coordinate x to PKCAU RAM */
        pkcau_memcpy_operand(0x0000055CU, curve_group_para->base_point_x, curve_group_para->base_point_x_len);
        /* write the curve base point coordinate y to PKCAU RAM */
        pkcau_memcpy_operand(0x000005B0U, curve_group_para->base_point_y, curve_group_para->base_point_y_len);
        /* write the hash value z and hash value z length in byte to PKCAU RAM */
        pkcau_memcpy_operand(0x00000DE8U, hash_para->hash_z, hash_para->hash_z_len);
        /* write the private key d to PKCAU RAM */
        pkcau_memcpy_operand(0x00000E3CU, curve_group_para->private_key_d, curve_group_para->private_key_d_len);
        /* write the curve prime order n to PKCAU RAM */
        pkcau_memcpy_operand(0x00000E94U, curve_group_para->order_n, curve_group_para->order_n_len);
        /* configure the operation mode */
        pkcau_mode_set(PKCAU_MODE_ECDSA_SIGN);
        /* start computation */
        pkcau_start();

        /* wait for PKCAU operation completed */
        timeout = PKCAU_DELAY;
        while((SET != pkcau_flag_get(PKCAU_FLAG_END)) && (0U != timeout)) {
            timeout--;
        }
        /* read results from RAM address */
        pkcau_memread(0x700U, (uint8_t *)result->sign_r, curve_group_para->order_n_len);
        pkcau_memread(0x754U, (uint8_t *)result->sign_s, curve_group_para->order_n_len);
        pkcau_memread(0xEE8U, (uint8_t *)&res, 1U);
        if(0U != result->sign_extra) {
            pkcau_memread(0x103CU, (uint8_t *)result->point_x, curve_group_para->order_n_len);
            pkcau_memread(0x1090U, (uint8_t *)result->point_y, curve_group_para->order_n_len);
        }
        /* clear end flag */
        pkcau_flag_clear(PKCAU_FLAG_END);
        /* disable PKCAU */
        pkcau_disable();
    }
    return res;
}

/*!
    \brief      execute ECDSA verification operation
                This function can only be used when interrupt is not enabled (API_ID(0x001AU))
    \param[in]  point_para: PKCAU point struct
                  point_x: point coordinate x
                  point_x_len: point coordinate x length in byte
                  point_y: point coordinate y
                  point_y_len: point coordinate y length in byte
    \param[in]  hash_para: hash struct
                  hash_z: hash value z
                  hash_z_len: hash value z length in byte
    \param[in]  signature_para: signature struct
                  sign_r: signature part r
                  sign_r_len: signature part r length in byte
                  sign_s: signature part s
                  sign_s_len: signature part s length in byte
    \param[in]  curve_group_para: PKCAU ECC curve parameter struct
                  modulus_p: curve modulus p
                  modulus_p_len: curve modulus p length in byte
                  coff_a: curve coefficient a
                  coff_a_len: curve coefficient a length in byte
                  coff_b: curve coefficient b
                  coff_b_len: curve coefficient b length in byte
                  base_point_x: curve base point coordinate x
                  base_point_x_len: curve base point coordinate x length in byte
                  base_point_y: curve base point coordinate y
                  base_point_y_len: curve base point coordinate y length in byte
                  order_n: curve prime order n
                  order_n_len: curve prime order n length in byte
                  a_sign: curve coefficient a sign

                  multi_k: scalar multiplier k
                  multi_k_len: scalar multiplier k length in byte
                  integer_k: integer k length in byte
                  integer_k_len: integer k length in byte
                  private_key_d: private key d
                  private_key_d_len: private key d length in byte
                  mont_para: montgomery parameter R2 mod n
                  mont_para_len: montgomery parameter R2 mod n length in byte
    \param[out] none
    \retval     flag indicating whether the signature verification operation was successful
    \note       This function includes timeout exit scenarios.
                Modify according to the user's actual usage scenarios.
*/
uint8_t pkcau_ecdsa_verification_operation(pkcau_point_parameter_struct *point_para, \
        pkcau_hash_parameter_struct *hash_para, \
        pkcau_signature_parameter_struct *signature_para, \
        const pkcau_ec_group_parameter_struct *curve_group_para)
{
    uint8_t res = 1U;
    uint32_t timeout;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameters */
    if(NOT_VALID_POINTER(point_para)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x001AU), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(hash_para)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x001AU), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(signature_para)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x001AU), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(curve_group_para)) {
        fw_debug_report_err(PKCAU_MODULE_ID, API_ID(0x001AU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* reset PKCAU */
        pkcau_deinit();
        /* enable PKCAU */
        pkcau_enable();
        /* wait for PKCAU busy flag to reset */
        timeout = PKCAU_DELAY;
        while((RESET != pkcau_flag_get(PKCAU_FLAG_BUSY)) && (0U != timeout)) {
            timeout--;
        }
        /* clear end flag */
        pkcau_flag_clear(PKCAU_FLAG_END);

        /* write the curve prime order n length, curve modulus p length in bit and curve coefficient a sign to PKCAU RAM */
        pkcau_memcpy_value(0x00000404U, (curve_group_para->order_n_len << 3));
        pkcau_memcpy_value(0x000004B4U, (curve_group_para->modulus_p_len << 3));
        pkcau_memcpy_value(0x0000045CU, curve_group_para->a_sign);

