wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_pkcau.c
        /* write the curve coefficient a to PKCAU RAM */
        pkcau_memcpy_operand(0x00000460U, curve_group_para->coff_a, curve_group_para->coff_a_len);
        /* write the curve modulus p to PKCAU RAM */
        pkcau_memcpy_operand(0x000004B8U, curve_group_para->modulus_p, curve_group_para->modulus_p_len);
        /* write the curve base point coordinate x to PKCAU RAM */
        pkcau_memcpy_operand(0x000005E8U, curve_group_para->base_point_x, curve_group_para->base_point_x_len);
        /* write the curve base point coordinate y to PKCAU RAM */
        pkcau_memcpy_operand(0x0000063CU, curve_group_para->base_point_y, curve_group_para->base_point_y_len);
        /* write the point coordinate x to PKCAU RAM */
        pkcau_memcpy_operand(0x00000F40U, point_para->point_x, point_para->point_x_len);
        /* write the point coordinate y to PKCAU RAM */
        pkcau_memcpy_operand(0x00000F94U, point_para->point_y, point_para->point_y_len);
        /* write the signature part r to PKCAU RAM */
        pkcau_memcpy_operand(0x00001098U, signature_para->sign_r, signature_para->sign_r_len);
        /* write the signature part s to PKCAU RAM */
        pkcau_memcpy_operand(0x00000A44U, signature_para->sign_s, signature_para->sign_s_len);
        /* write the hash value z and hash value z length in byte to PKCAU RAM */
        pkcau_memcpy_operand(0x00000FE8U, hash_para->hash_z, hash_para->hash_z_len);
        /* write the curve prime order n to PKCAU RAM */
        pkcau_memcpy_operand(0x00000D5CU, curve_group_para->order_n, curve_group_para->order_n_len);
        /* configure the operation mode */
        pkcau_mode_set(PKCAU_MODE_ECDSA_VERIFICATION);
        /* start computation */
        pkcau_start();

        /* wait for PKCAU operation completed */
        timeout = PKCAU_DELAY;
        while((SET != pkcau_flag_get(PKCAU_FLAG_END)) && (0U != timeout)) {
            timeout--;
        }
        pkcau_memread(0x5B0U, (uint8_t *)&res, 1U);
        /* clear end flag */
        pkcau_flag_clear(PKCAU_FLAG_END);
        /* disable PKCAU */
        pkcau_disable();
    }
    return res;
}

/*!
    \brief      get PKCAU flag status (API_ID(0x001BU))
    \param[in]  flag: PKCAU flags
                only one parameter can be selected which is shown as below:
      \arg        PKCAU_FLAG_ADDRERR: address error flag
      \arg        PKCAU_FLAG_RAMERR: PKCAU RAM error flag
      \arg        PKCAU_FLAG_END: end of PKCAU operation flag
      \arg        PKCAU_FLAG_BUSY: busy flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus pkcau_flag_get(uint32_t flag)
{
    FlagStatus reval = RESET;

    if(RESET != (PKCAU_STAT & (flag  & PKCAU_GET_FLAG_MASK))) {
        reval = SET;
    }
    return reval;
}

/*!
    \brief      clear PKCAU flag status (API_ID(0x001CU))
    \param[in]  flag: PKCAU flags
                one or more parameters can be selected which is shown as below:
      \arg        PKCAU_FLAG_ADDRERR: address error flag
      \arg        PKCAU_FLAG_RAMERR: PKCAU RAM error flag
      \arg        PKCAU_FLAG_END: end of PKCAU operation flag
    \param[out] none
    \retval     none
*/
void pkcau_flag_clear(uint32_t flag)
{
    PKCAU_STATC |= (flag & PKCAU_CLEAR_FLAG_MASK);
}

/*!
    \brief      enable PKCAU interrupt (API_ID(0x001DU))
    \param[in]  interrupt: interrupt type
                one or more parameters can be selected which is shown as below:
      \arg        PKCAU_INT_ADDRERR: address error interrupt
      \arg        PKCAU_INT_RAMERR: PKCAU RAM error interrupt
      \arg        PKCAU_INT_END: end of PKCAU operation interrupt
    \param[out] none
    \retval     none
*/
void pkcau_interrupt_enable(uint32_t interrupt)
{
    PKCAU_CTL |= (interrupt & PKCAU_INT_MASK);
}

/*!
    \brief      disable PKCAU interrupt (API_ID(0x001EU))
    \param[in]  interrupt: interrupt type
                one or more parameters can be selected which is shown as below:
      \arg        PKCAU_INT_ADDRERR: address error interrupt
      \arg        PKCAU_INT_RAMERR: PKCAU RAM error interrupt
      \arg        PKCAU_INT_END: end of PKCAU operation interrupt
    \param[out] none
    \retval     none
*/
void pkcau_interrupt_disable(uint32_t interrupt)
{
    PKCAU_CTL &= ~(interrupt & PKCAU_INT_MASK);
}

/*!
    \brief      get PKCAU interrupt flag status (API_ID(0x001FU))
    \param[in]  int_flag: PKCAU interrupt flags
                only one parameter can be selected which is shown as below:
      \arg        PKCAU_INT_FLAG_ADDRERR: address error interrupt flag
      \arg        PKCAU_INT_FLAG_RAMERR: PKCAU RAM error interrupt flag
      \arg        PKCAU_INT_FLAG_ENDF: end of PKCAU operation interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus pkcau_interrupt_flag_get(uint32_t int_flag)
{
    FlagStatus reval = RESET;

    uint32_t reg1 = PKCAU_CTL;
    uint32_t reg2 = PKCAU_STAT;

    switch(int_flag) {
    case PKCAU_INT_FLAG_ADDRERR:
        reg1 = reg1 & PKCAU_CTL_ADDRERRIE;
        reg2 = reg2 & PKCAU_STAT_ADDRERR;
        break;
    case PKCAU_INT_FLAG_RAMERR:
        reg1 = reg1 & PKCAU_CTL_RAMERRIE;
        reg2 = reg2 & PKCAU_STAT_RAMERR;
        break;
    case PKCAU_INT_FLAG_ENDF:
        reg1 = reg1 & PKCAU_CTL_ENDIE;
        reg2 = reg2 & PKCAU_STAT_ENDF;
        break;
    default:
        break;
    }

    if(reg1 && reg2) {
        reval = SET;
    }

    return reval;
}

/*!
    \brief      clear PKCAU interrupt flag status (API_ID(0x0020U))
    \param[in]  int_flag: PKCAU interrupt flags
                only one parameter can be selected which is shown as below:
      \arg        PKCAU_INT_FLAG_ADDRERR: address error interrupt flag
      \arg        PKCAU_INT_FLAG_RAMERR: PKCAU RAM error interrupt flag
      \arg        PKCAU_INT_FLAG_ENDF: end of PKCAU operation interrupt flag
    \param[out] none
    \retval     none
*/
void pkcau_interrupt_flag_clear(uint32_t int_flag)
{
    switch(int_flag) {
    /* clear address error interrupt flag */
    case PKCAU_INT_FLAG_ADDRERR:
        PKCAU_STATC |= PKCAU_STATC_ADDRERRC;
        break;
    /* clear PKCAU RAM error interrupt flag */
    case PKCAU_INT_FLAG_RAMERR:
        PKCAU_STATC |= PKCAU_STATC_RAMERRC;
        break;
    /* clear end of PKCAU operation interrupt flag */
    case PKCAU_INT_FLAG_ENDF:
        PKCAU_STATC |= PKCAU_STATC_ENDFC;
        break;
    default:
        break;
    }

